Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR35_DFP/2.1.62/atdf/ATSAMR35J17B.atdf
          </instance>
        </module>
        <module name="SystemControl" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
            <parameters>
              <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PAC PM SUPC" caption="System peripherals shared interrupt"/>
        <interrupt name="WDT" index="1" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="2" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC" index="3" module-instance="EIC" caption="External Interrupt Controller"/>
        <interrupt name="NVMCTRL" index="4" module-instance="NVMCTRL" caption="Non-Volatile Memory Controller"/>
        <interrupt name="DMAC" index="5" module-instance="DMAC" caption="Direct Memory Controller"/>
        <interrupt name="EVSYS" index="7" module-instance="EVSYS" caption="Event Systems"/>
        <interrupt name="SERCOM0" index="8" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1" index="9" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2" index="10" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3" index="11" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM4" index="12" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM5" index="13" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="TCC0" index="14" module-instance="TCC0" caption="Timer/Counter for Control Applications 0"/>
        <interrupt name="TCC1" index="15" module-instance="TCC1" caption="Timer/Counter for Control Applications 1"/>
        <interrupt name="TCC2" index="16" module-instance="TCC2" caption="Timer/Counter for Control Applications 2"/>
        <interrupt name="TC0" index="17" module-instance="TC0" caption="Timer/Counter 0"/>
        <interrupt name="TC1" index="18" module-instance="TC1" caption="Timer/Counter 1"/>
        <interrupt name="TC2" index="19" module-instance="TC2" caption="Timer/Counter 2"/>
        <interrupt name="TC3" index="20" module-instance="TC3" caption="Timer/Counter 3"/>
        <interrupt name="TC4" index="21" module-instance="TC4" caption="Timer/Counter 4"/>
        <interrupt name="ADC" index="22" module-instance="ADC" caption="Analog-to-Digital Converter"/>
        <interrupt name="AC" index="23" module-instance="AC" caption="Analog Comparators"/>
        <interrupt name="PTC" index="25" module-instance="PTC" caption="Peripheral Touch Controller"/>
        <interrupt name="AES" index="26" module-instance="AES" caption="Advanced Encryption Standard"/>
        <interrupt name="TRNG" index="27" module-instance="TRNG" caption="True Random Number Generator"/>
      </interrupts>
      <events>
        <generators>
          <generator name="RTC_CMP_0" index="1" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="2" module-instance="RTC"/>
          <generator name="RTC_OVF" index="3" module-instance="RTC"/>
          <generator name="RTC_PER_0" index="4" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="5" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="11" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="12" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="13" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="14" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="15" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="18" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="19" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="20" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="27" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="28" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="29" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="30" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="31" module-instance="DMAC"/>
          <generator name="DMAC_CH_4" index="32" module-instance="DMAC"/>
          <generator name="DMAC_CH_5" index="33" module-instance="DMAC"/>
          <generator name="DMAC_CH_6" index="34" module-instance="DMAC"/>
          <generator name="DMAC_CH_7" index="35" module-instance="DMAC"/>
          <generator name="TCC0_OVF" index="36" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="37" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="38" module-instance="TCC0"/>
          <generator name="TCC0_MCX_0" index="39" module-instance="TCC0"/>
          <generator name="TCC0_MCX_1" index="40" module-instance="TCC0"/>
          <generator name="TCC0_MCX_2" index="41" module-instance="TCC0"/>
          <generator name="TCC0_MCX_3" index="42" module-instance="TCC0"/>
          <generator name="TCC1_OVF" index="43" module-instance="TCC1"/>
          <generator name="TCC1_TRG" index="44" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="45" module-instance="TCC1"/>
          <generator name="TCC1_MCX_0" index="46" module-instance="TCC1"/>
          <generator name="TCC1_MCX_1" index="47" module-instance="TCC1"/>
          <generator name="TCC2_OVF" index="48" module-instance="TCC2"/>
          <generator name="TCC2_TRG" index="49" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="50" module-instance="TCC2"/>
          <generator name="TCC2_MCX_0" index="51" module-instance="TCC2"/>
          <generator name="TCC2_MCX_1" index="52" module-instance="TCC2"/>
          <generator name="TC0_OVF" index="53" module-instance="TC0"/>
          <generator name="TC0_MCX_0" index="54" module-instance="TC0"/>
          <generator name="TC0_MCX_1" index="55" module-instance="TC0"/>
          <generator name="TC1_OVF" index="56" module-instance="TC1"/>
          <generator name="TC1_MCX_0" index="57" module-instance="TC1"/>
          <generator name="TC1_MCX_1" index="58" module-instance="TC1"/>
          <generator name="TC2_OVF" index="59" module-instance="TC2"/>
          <generator name="TC2_MCX_0" index="60" module-instance="TC2"/>
          <generator name="TC2_MCX_1" index="61" module-instance="TC2"/>
          <generator name="TC3_OVF" index="62" module-instance="TC3"/>
          <generator name="TC3_MCX_0" index="63" module-instance="TC3"/>
          <generator name="TC3_MCX_1" index="64" module-instance="TC3"/>
          <generator name="TC4_OVF" index="65" module-instance="TC4"/>
          <generator name="TC4_MCX_0" index="66" module-instance="TC4"/>
          <generator name="TC4_MCX_1" index="67" module-instance="TC4"/>
          <generator name="ADC_RESRDY" index="68" module-instance="ADC"/>
          <generator name="ADC_WINMON" index="69" module-instance="ADC"/>
          <generator name="AC_COMP_0" index="70" module-instance="AC"/>
          <generator name="AC_COMP_1" index="71" module-instance="AC"/>
          <generator name="AC_WIN_0" index="72" module-instance="AC"/>
          <generator name="TRNG_READY" index="77" module-instance="TRNG"/>
          <generator name="CCL_LUTOUT_0" index="78" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="79" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_2" index="80" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_3" index="81" module-instance="CCL"/>
          <generator name="PAC_ACCERR" index="82" module-instance="PAC"/>
        </generators>
        <users>
          <user name="PORT_EV_0" index="0" module-instance="PORT"/>
          <user name="PORT_EV_1" index="1" module-instance="PORT"/>
          <user name="PORT_EV_2" index="2" module-instance="PORT"/>
          <user name="PORT_EV_3" index="3" module-instance="PORT"/>
          <user name="DMAC_CH_0" index="4" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="5" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="6" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_4" index="8" module-instance="DMAC"/>
          <user name="DMAC_CH_5" index="9" module-instance="DMAC"/>
          <user name="DMAC_CH_6" index="10" module-instance="DMAC"/>
          <user name="DMAC_CH_7" index="11" module-instance="DMAC"/>
          <user name="TCC0_EV_0" index="12" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="13" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="14" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="15" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="16" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="17" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="18" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="19" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="20" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="21" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="22" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="23" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="24" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="25" module-instance="TCC2"/>
          <user name="TC0_EVU" index="26" module-instance="TC0"/>
          <user name="TC1_EVU" index="27" module-instance="TC1"/>
          <user name="TC2_EVU" index="28" module-instance="TC2"/>
          <user name="TC3_EVU" index="29" module-instance="TC3"/>
          <user name="TC4_EVU" index="30" module-instance="TC4"/>
          <user name="ADC_START" index="31" module-instance="ADC"/>
          <user name="ADC_SYNC" index="32" module-instance="ADC"/>
          <user name="AC_SOC_0" index="33" module-instance="AC"/>
          <user name="AC_SOC_1" index="34" module-instance="AC"/>
          <user name="CCL_LUTIN_0" index="38" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="39" module-instance="CCL"/>
          <user name="CCL_LUTIN_2" index="40" module-instance="CCL"/>
          <user name="CCL_LUTIN_3" index="41" module-instance="CCL"/>
          <user name="MTB_START" index="43" module-instance="MTB"/>
          <user name="MTB_STOP" index="44" module-instance="MTB"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x1081022C"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.0.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
