Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR35_DFP/2.1.62/atdf/ATSAMR35J17B.atdf
      <value-group name="EIC_CONFIG__SENSE5">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE6">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE7">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
    </module>
    <module name="EVSYS" id="U2256" version="1.0.1" caption="Event System Interface">
      <register-group name="EVSYS" caption="Event System Interface">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="CHSTATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Channel Status">
          <bitfield name="USRRDY0" caption="Channel 0 User Ready" mask="0x1"/>
          <bitfield name="USRRDY1" caption="Channel 1 User Ready" mask="0x2"/>
          <bitfield name="USRRDY2" caption="Channel 2 User Ready" mask="0x4"/>
          <bitfield name="USRRDY3" caption="Channel 3 User Ready" mask="0x8"/>
          <bitfield name="USRRDY4" caption="Channel 4 User Ready" mask="0x10"/>
          <bitfield name="USRRDY5" caption="Channel 5 User Ready" mask="0x20"/>
          <bitfield name="USRRDY6" caption="Channel 6 User Ready" mask="0x40"/>
          <bitfield name="USRRDY7" caption="Channel 7 User Ready" mask="0x80"/>
          <bitfield name="USRRDY8" caption="Channel 8 User Ready" mask="0x100"/>
          <bitfield name="USRRDY9" caption="Channel 9 User Ready" mask="0x200"/>
          <bitfield name="USRRDY10" caption="Channel 10 User Ready" mask="0x400"/>
          <bitfield name="USRRDY11" caption="Channel 11 User Ready" mask="0x800"/>
          <bitfield name="CHBUSY0" caption="Channel 0 Busy" mask="0x10000"/>
          <bitfield name="CHBUSY1" caption="Channel 1 Busy" mask="0x20000"/>
          <bitfield name="CHBUSY2" caption="Channel 2 Busy" mask="0x40000"/>
          <bitfield name="CHBUSY3" caption="Channel 3 Busy" mask="0x80000"/>
          <bitfield name="CHBUSY4" caption="Channel 4 Busy" mask="0x100000"/>
          <bitfield name="CHBUSY5" caption="Channel 5 Busy" mask="0x200000"/>
          <bitfield name="CHBUSY6" caption="Channel 6 Busy" mask="0x400000"/>
          <bitfield name="CHBUSY7" caption="Channel 7 Busy" mask="0x800000"/>
          <bitfield name="CHBUSY8" caption="Channel 8 Busy" mask="0x1000000"/>
          <bitfield name="CHBUSY9" caption="Channel 9 Busy" mask="0x2000000"/>
          <bitfield name="CHBUSY10" caption="Channel 10 Busy" mask="0x4000000"/>
          <bitfield name="CHBUSY11" caption="Channel 11 Busy" mask="0x8000000"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun Interrupt Enable" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun Interrupt Enable" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun Interrupt Enable" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun Interrupt Enable" mask="0x80"/>
          <bitfield name="OVR8" caption="Channel 8 Overrun Interrupt Enable" mask="0x100"/>
          <bitfield name="OVR9" caption="Channel 9 Overrun Interrupt Enable" mask="0x200"/>
          <bitfield name="OVR10" caption="Channel 10 Overrun Interrupt Enable" mask="0x400"/>
          <bitfield name="OVR11" caption="Channel 11 Overrun Interrupt Enable" mask="0x800"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection Interrupt Enable" mask="0x10000"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection Interrupt Enable" mask="0x20000"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection Interrupt Enable" mask="0x40000"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection Interrupt Enable" mask="0x80000"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection Interrupt Enable" mask="0x100000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection Interrupt Enable" mask="0x200000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection Interrupt Enable" mask="0x400000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection Interrupt Enable" mask="0x800000"/>
          <bitfield name="EVD8" caption="Channel 8 Event Detection Interrupt Enable" mask="0x1000000"/>
          <bitfield name="EVD9" caption="Channel 9 Event Detection Interrupt Enable" mask="0x2000000"/>
          <bitfield name="EVD10" caption="Channel 10 Event Detection Interrupt Enable" mask="0x4000000"/>
          <bitfield name="EVD11" caption="Channel 11 Event Detection Interrupt Enable" mask="0x8000000"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun Interrupt Enable" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun Interrupt Enable" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun Interrupt Enable" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun Interrupt Enable" mask="0x80"/>
          <bitfield name="OVR8" caption="Channel 8 Overrun Interrupt Enable" mask="0x100"/>
          <bitfield name="OVR9" caption="Channel 9 Overrun Interrupt Enable" mask="0x200"/>
          <bitfield name="OVR10" caption="Channel 10 Overrun Interrupt Enable" mask="0x400"/>
          <bitfield name="OVR11" caption="Channel 11 Overrun Interrupt Enable" mask="0x800"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection Interrupt Enable" mask="0x10000"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection Interrupt Enable" mask="0x20000"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection Interrupt Enable" mask="0x40000"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection Interrupt Enable" mask="0x80000"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection Interrupt Enable" mask="0x100000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection Interrupt Enable" mask="0x200000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection Interrupt Enable" mask="0x400000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection Interrupt Enable" mask="0x800000"/>
          <bitfield name="EVD8" caption="Channel 8 Event Detection Interrupt Enable" mask="0x1000000"/>
          <bitfield name="EVD9" caption="Channel 9 Event Detection Interrupt Enable" mask="0x2000000"/>
          <bitfield name="EVD10" caption="Channel 10 Event Detection Interrupt Enable" mask="0x4000000"/>
          <bitfield name="EVD11" caption="Channel 11 Event Detection Interrupt Enable" mask="0x8000000"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVR0" caption="Channel 0 Overrun" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun" mask="0x80"/>
          <bitfield name="OVR8" caption="Channel 8 Overrun" mask="0x100"/>
          <bitfield name="OVR9" caption="Channel 9 Overrun" mask="0x200"/>
          <bitfield name="OVR10" caption="Channel 10 Overrun" mask="0x400"/>
          <bitfield name="OVR11" caption="Channel 11 Overrun" mask="0x800"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection" mask="0x10000"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection" mask="0x20000"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection" mask="0x40000"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection" mask="0x80000"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection" mask="0x100000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection" mask="0x200000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection" mask="0x400000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection" mask="0x800000"/>
          <bitfield name="EVD8" caption="Channel 8 Event Detection" mask="0x1000000"/>
          <bitfield name="EVD9" caption="Channel 9 Event Detection" mask="0x2000000"/>
          <bitfield name="EVD10" caption="Channel 10 Event Detection" mask="0x4000000"/>
          <bitfield name="EVD11" caption="Channel 11 Event Detection" mask="0x8000000"/>
        </register>
        <register name="SWEVT" offset="0x1C" rw="W" size="4" initval="0x00000000" caption="Software Event">
          <bitfield name="CHANNEL0" caption="Channel 0 Software Selection" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Channel 1 Software Selection" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Channel 2 Software Selection" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Channel 3 Software Selection" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Channel 4 Software Selection" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Channel 5 Software Selection" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Channel 6 Software Selection" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Channel 7 Software Selection" mask="0x80"/>
          <bitfield name="CHANNEL8" caption="Channel 8 Software Selection" mask="0x100"/>
          <bitfield name="CHANNEL9" caption="Channel 9 Software Selection" mask="0x200"/>
          <bitfield name="CHANNEL10" caption="Channel 10 Software Selection" mask="0x400"/>
          <bitfield name="CHANNEL11" caption="Channel 11 Software Selection" mask="0x800"/>
        </register>
        <register name="CHANNEL" offset="0x20" rw="RW" size="4" count="12" initval="0x00008000" caption="Channel n">
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x7F"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="EVSYS_CHANNEL__EDGSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000"/>
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
        </register>
        <register name="USER" offset="0x80" rw="RW" size="4" count="45" initval="0x00000000" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0x1F"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
      </value-group>
    </module>
    <module name="GCLK" id="U2122" version="1.1.1" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchroniation Busy bit" mask="0x1"/>
          <bitfield name="GENCTRL0" caption="Generic Clock Generator Control 0 Synchronization Busy bits" mask="0x4" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL1" caption="Generic Clock Generator Control 1 Synchronization Busy bits" mask="0x8" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL2" caption="Generic Clock Generator Control 2 Synchronization Busy bits" mask="0x10" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL3" caption="Generic Clock Generator Control 3 Synchronization Busy bits" mask="0x20" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL4" caption="Generic Clock Generator Control 4 Synchronization Busy bits" mask="0x40" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL5" caption="Generic Clock Generator Control 5 Synchronization Busy bits" mask="0x80" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL6" caption="Generic Clock Generator Control 6 Synchronization Busy bits" mask="0x100" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL7" caption="Generic Clock Generator Control 7 Synchronization Busy bits" mask="0x200" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL8" caption="Generic Clock Generator Control 8 Synchronization Busy bits" mask="0x400" values="GCLK_SYNCBUSY__GENCTRL"/>
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" size="4" count="9" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0xF" values="GCLK_GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GCLK_GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="36" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0xF" values="GCLK_PCHCTRL__GEN"/>
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="GCLK_SYNCBUSY__GENCTRL">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x1"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x2"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x4"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x8"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x10"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x20"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x40"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x80"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="0x100"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="OSC32K" caption="OSC32K oscillator output" value="4"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="5"/>
        <value name="OSC16M" caption="OSC16M oscillator output" value="6"/>
        <value name="DFLL48M" caption="DFLL48M output" value="7"/>
        <value name="DPLL96M" caption="DPLL96M output" value="8"/>
      </value-group>
      <value-group name="GCLK_PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="0x8"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__DIVSEL">
        <value name="DIV1" caption="Divide input directly by divider factor" value="0x0"/>
        <value name="DIV2" caption="Divide input by 2^(divider factor+ 1)" value="0x1"/>
      </value-group>
    </module>
    <module name="MCLK" id="U2234" version="1.0.1" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
        </register>
        <register name="INTENCLR" offset="0x1" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x2" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x3" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x01" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="CPUDIV" offset="0x4" rw="RW" size="1" initval="0x01" caption="CPU Clock Division">
          <bitfield name="CPUDIV" caption="CPU Clock Division Factor" mask="0xFF" values="MCLK_CPUDIV__CPUDIV"/>
        </register>
        <register name="LPDIV" offset="0x5" rw="RW" size="1" initval="0x01" caption="Low-Power Clock Division">
          <bitfield name="LPDIV" caption="Low-Power Clock Division Factor" mask="0xFF" values="MCLK_LPDIV__LPDIV"/>
        </register>
        <register name="BUPDIV" offset="0x6" rw="RW" size="1" initval="0x01" caption="Backup Clock Division">
          <bitfield name="BUPDIV" caption="Backup Clock Division Factor" mask="0xFF" values="MCLK_BUPDIV__BUPDIV"/>
        </register>
