Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR35_DFP/2.1.62/atdf/ATSAMR35J17B.atdf
        <register name="AHBMASK" offset="0x10" rw="RW" size="4" initval="0x000FFFFF" caption="AHB Mask">
          <bitfield name="HPB0_" caption="HPB0 AHB Clock Mask" mask="0x1"/>
          <bitfield name="HPB1_" caption="HPB1 AHB Clock Mask" mask="0x2"/>
          <bitfield name="HPB2_" caption="HPB2 AHB Clock Mask" mask="0x4"/>
          <bitfield name="HPB3_" caption="HPB3 AHB Clock Mask" mask="0x8"/>
          <bitfield name="HPB4_" caption="HPB4 AHB Clock Mask" mask="0x10"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x20"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x100"/>
          <bitfield name="HSRAM_" caption="HSRAM AHB Clock Mask" mask="0x200"/>
          <bitfield name="LPRAM_" caption="LPRAM AHB Clock Mask" mask="0x400"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x800"/>
          <bitfield name="USB_" caption="USB AHB Clock Mask" mask="0x1000"/>
          <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x4000"/>
          <bitfield name="NVMCTRL_PICACHU_" caption="NVMCTRL_PICACHU AHB Clock Mask" mask="0x8000"/>
          <bitfield name="L2HBRIDGES_H_" caption="L2HBRIDGES_H AHB Clock Mask" mask="0x10000"/>
          <bitfield name="H2LBRIDGES_H_" caption="H2LBRIDGES_H AHB Clock Mask" mask="0x20000"/>
          <bitfield name="HSRAM_AHBSETUPKEEPER_" caption="HSRAM_AHBSETUPKEEPER AHB Clock Mask" mask="0x40000"/>
          <bitfield name="HSRAM_HMATRIXLP2HMCRAMCHSBRIDGE_" caption="HSRAM_HMATRIXLP2HMCRAMCHSBRIDGE AHB Clock Mask" mask="0x80000"/>
        </register>
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x00001FFF" caption="APBA Mask">
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x1"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x2"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x4"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x8"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x20"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x40"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x80"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x100"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x200"/>
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x400"/>
        </register>
        <register name="APBBMASK" offset="0x18" rw="RW" size="4" initval="0x00000017" caption="APBB Mask">
          <bitfield name="USB_" caption="USB APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
        </register>
        <register name="APBCMASK" offset="0x1C" rw="RW" size="4" initval="0x00007FFF" caption="APBC Mask">
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x4"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Clock Enable" mask="0x8"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Clock Enable" mask="0x10"/>
          <bitfield name="TCC0_" caption="TCC0 APB Clock Enable" mask="0x20"/>
          <bitfield name="TCC1_" caption="TCC1 APB Clock Enable" mask="0x40"/>
          <bitfield name="TCC2_" caption="TCC2 APB Clock Enable" mask="0x80"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x100"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x200"/>
          <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x400"/>
          <bitfield name="TC3_" caption="TC3 APB Clock Enable" mask="0x800"/>
          <bitfield name="AES_" caption="AES APB Clock Enable" mask="0x2000"/>
          <bitfield name="TRNG_" caption="TRNG APB Clock Enable" mask="0x4000"/>
        </register>
        <register name="APBDMASK" offset="0x20" rw="RW" size="4" initval="0x000000FF" caption="APBD Mask">
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Clock Enable" mask="0x2"/>
          <bitfield name="TC4_" caption="TC4 APB Clock Enable" mask="0x4"/>
          <bitfield name="ADC_" caption="ADC APB Clock Enable" mask="0x8"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x10"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x20"/>
          <bitfield name="OPAMP_" caption="OPAMP APB Clock Enable" mask="0x40"/>
          <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x80"/>
        </register>
        <register name="APBEMASK" offset="0x24" rw="RW" size="4" initval="0x0000000D" caption="APBE Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="MCLK_CPUDIV__CPUDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
      <value-group name="MCLK_LPDIV__LPDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
      <value-group name="MCLK_BUPDIV__BUPDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
