Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR35_DFP/2.1.62/atdf/ATSAMR35J17B.atdf
        <register name="DFLLVAL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="DFLL48M Value">
          <bitfield name="FINE" caption="Fine Value" mask="0x3FF"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF0000"/>
        </register>
        <register name="DFLLMUL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="DFLL48M Multiplier">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
          <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0x3FF0000"/>
          <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
        </register>
        <register name="DFLLSYNC" offset="0x24" rw="RW" size="1" initval="0x00" caption="DFLL48M Synchronization">
          <bitfield name="READREQ" caption="Read Request" mask="0x80"/>
        </register>
        <register name="DPLLCTRLA" offset="0x28" rw="RW" access="WSYNC" size="1" initval="0x80" caption="DPLL Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand" mask="0x80"/>
        </register>
        <register name="DPLLRATIO" offset="0x2C" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DPLL Ratio Control">
          <bitfield name="LDR" caption="Loop Divider Ratio" mask="0xFFF"/>
          <bitfield name="LDRFRAC" caption="Loop Divider Ratio Fractional Part" mask="0xF0000"/>
        </register>
        <register name="DPLLCTRLB" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Digital Core Configuration">
          <bitfield name="FILTER" caption="Proportional Integral Filter Selection" mask="0x3" values="OSCCTRL_DPLLCTRLB__FILTER"/>
          <bitfield name="LPEN" caption="Low-Power Enable" mask="0x4"/>
          <bitfield name="WUF" caption="Wake Up Fast" mask="0x8"/>
          <bitfield name="REFCLK" caption="Reference Clock Selection" mask="0x30" values="OSCCTRL_DPLLCTRLB__REFCLK"/>
          <bitfield name="LTIME" caption="Lock Time" mask="0x700" values="OSCCTRL_DPLLCTRLB__LTIME"/>
          <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x1000"/>
          <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
        </register>
        <register name="DPLLPRESC" offset="0x34" rw="RW" access="WSYNC" size="1" initval="0x00" caption="DPLL Prescaler">
          <bitfield name="PRESC" caption="Output Clock Prescaler" mask="0x3" values="OSCCTRL_DPLLPRESC__PRESC"/>
        </register>
        <register name="DPLLSYNCBUSY" offset="0x38" rw="R" size="1" initval="0x00" caption="DPLL Synchronization Busy">
          <bitfield name="ENABLE" caption="DPLL Enable Synchronization Status" mask="0x2"/>
          <bitfield name="DPLLRATIO" caption="DPLL Ratio Synchronization Status" mask="0x4"/>
          <bitfield name="DPLLPRESC" caption="DPLL Prescaler Synchronization Status" mask="0x8"/>
        </register>
        <register name="DPLLSTATUS" offset="0x3C" rw="R" size="1" initval="0x00" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock Status" mask="0x1"/>
          <bitfield name="CLKRDY" caption="DPLL Clock Ready" mask="0x2"/>
        </register>
      </register-group>
      <value-group name="OSCCTRL_OSC16MCTRL__FSEL">
        <value name="4" caption="4MHz" value="0x0"/>
        <value name="8" caption="8MHz" value="0x1"/>
        <value name="12" caption="12MHz" value="0x2"/>
        <value name="16" caption="16MHz" value="0x3"/>
      </value-group>
      <value-group name="OSCCTRL_XOSCCTRL__STARTUP">
        <value name="CYCLE1" caption="31 us" value="0"/>
        <value name="CYCLE2" caption="61 us" value="1"/>
        <value name="CYCLE4" caption="122 us" value="2"/>
        <value name="CYCLE8" caption="244 us" value="3"/>
        <value name="CYCLE16" caption="488 us" value="4"/>
        <value name="CYCLE32" caption="977 us" value="5"/>
        <value name="CYCLE64" caption="1953 us" value="6"/>
        <value name="CYCLE128" caption="3906 us" value="7"/>
        <value name="CYCLE256" caption="7813 us" value="8"/>
        <value name="CYCLE512" caption="15625 us" value="9"/>
        <value name="CYCLE1024" caption="31250 us" value="10"/>
        <value name="CYCLE2048" caption="62500 us" value="11"/>
        <value name="CYCLE4096" caption="125000 us" value="12"/>
        <value name="CYCLE8192" caption="250000 us" value="13"/>
        <value name="CYCLE16384" caption="500000 us" value="14"/>
        <value name="CYCLE32768" caption="1000000 us" value="15"/>
      </value-group>
      <value-group name="OSCCTRL_XOSCCTRL__GAIN">
        <value name="GAIN2" caption="2 MHz" value="0"/>
        <value name="GAIN4" caption="4 MHz" value="1"/>
        <value name="GAIN8" caption="8 MHz" value="2"/>
        <value name="GAIN16" caption="16 MHz" value="3"/>
        <value name="GAIN30" caption="30 MHz" value="4"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__LTIME">
        <value name="DEFAULT" caption="No time-out. Automatic lock." value="0"/>
        <value name="8MS" caption="Time-out if no lock within 8ms" value="4"/>
        <value name="9MS" caption="Time-out if no lock within 9ms" value="5"/>
        <value name="10MS" caption="Time-out if no lock within 10ms" value="6"/>
        <value name="11MS" caption="Time-out if no lock within 11ms" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__FILTER">
        <value name="DEFAULT" caption="Default filter mode" value="0"/>
        <value name="LBFILT" caption="Low bandwidth filter" value="1"/>
        <value name="HBFILT" caption="High bandwidth filter" value="2"/>
        <value name="HDFILT" caption="High damping filter" value="3"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__REFCLK">
        <value name="XOSC32K" caption="XOSC32K clock reference" value="0"/>
        <value name="XOSC" caption="XOSC clock reference" value="1"/>
        <value name="GCLK" caption="GCLK clock reference" value="2"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLPRESC__PRESC">
        <value name="DIV1" caption="DPLL output is divided by 1" value="0"/>
        <value name="DIV2" caption="DPLL output is divided by 2" value="1"/>
        <value name="DIV4" caption="DPLL output is divided by 4" value="2"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2246" version="1.1.0" caption="32k Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32k Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
        </register>
